app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('hải sản', '2023-08-21 07:47:20.333208', '2023-08-21 07:47:20.333208')

  def update
    if @category.update(category_params)
---
UPDATE `categories` SET `categories`.`updated_at` = '2023-08-21 07:47:20.359557' WHERE `categories`.`id` = 6

  def set_category
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 6 LIMIT 1