app/controllers/users/omniauth_callbacks_controller.rb

    def google
      # You need to implement the method below in your model (e.g. app/models/user.rb)
      @user = User.from_omniauth(request.env["omniauth.auth"])
      @user.skip_validation = true
      @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `gender`, `phone`, `address`, `role`, `created_at`, `updated_at`, `email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `confirmation_token`, `confirmed_at`, `confirmation_sent_at`, `unconfirmed_email`, `provider`, `uid`, `name`) VALUES (NULL, NULL, NULL, NULL, NULL, 1, '2023-08-18 10:18:12.814526', '2023-08-18 10:18:12.814526', 'thanhcongpham22072002@gmail.com', '$2a$12$t2DoJnqKXxLlT3YanNZxtuuwSbDkcGjElmCqPIET6wD7Vqy31uNJ6', NULL, NULL, NULL, NULL, '2023-08-18 10:18:12.808466', NULL, NULL, 'google', '116016040843001409344', 'thanhcongpham22072002@gmail.com')